# Pandas - Operations on Index

Index number in Pandas identifies each row in DataFrame

In [1]:
import pandas as pd

In [20]:
# Creating a DataFrame
data = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30],
  "qualified": [True, False, False]
}
idx = ["X", "Y", "Z"]

df = pd.DataFrame(data, index=idx)
df

    name  age  qualified
X  Sally   50       True
Y   Mary   40      False
Z   John   30      False

In [22]:
# Give an index a specific name
dfn = df.copy(deep=True)
dfn.index.name = 'idx'
dfn

      name  age  qualified
idx
X    Sally   50       True
Y     Mary   40      False
Z     John   30      False

### Reset index

In [26]:
df1 = df.reset_index() # creates new index, the old index becomes a column
df1

  index   name  age  qualified
0     X  Sally   50       True
1     Y   Mary   40      False
2     Z   John   30      False

In [24]:
dfn1 = dfn.reset_index() # creates new index, the old index becomes a column (keeps the custom name)
dfn1

  idx   name  age  qualified
0   X  Sally   50       True
1   Y   Mary   40      False
2   Z   John   30      False

#### reset_index() opearion does not modify df that is used for the operation

In [25]:
df.reset_index() 
df

    name  age  qualified
X  Sally   50       True
Y   Mary   40      False
Z   John   30      False

In [15]:
df1.drop(['Y'], inplace=True) # drop([1]) won't work here
df1

      name  age  qualified
idx
X    Sally   50       True
Z     John   30      False

In [17]:

df3 = df2.reset_index()
df3

  idx   name  age  qualified
0   X  Sally   50       True
1   Z   John   30      False

In [18]:
# creates new index, but the old index is dropped
df4 = df2.reset_index(drop=True)
df4

    name  age  qualified
0  Sally   50       True
1   John   30      False

In [4]:
# dropping the 0th and the 1st rows by index
df = df.drop([0, 1])
df

          name   runs
2      Ponting  13704
3    Jayasurya  13430
4  Jayawardene  12650
5        Kohli  11867
6          Haq  11739
7       Kallis  11579
8      Ganguly  11363
9       Dravid  10889

In [5]:
# resetting the DataFrame index
df = df.reset_index()
df

   index         name   runs
0      2      Ponting  13704
1      3    Jayasurya  13430
2      4  Jayawardene  12650
3      5        Kohli  11867
4      6          Haq  11739
5      7       Kallis  11579
6      8      Ganguly  11363
7      9       Dravid  10889